#include "hott.h"

#include <hardware/flash.h>
#include <hardware/sync.h>
#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "airspeed.h"
#include "bmp180.h"
#include "bmp280.h"
#include "common.h"
#include "config.h"
#include "current.h"
#include "esc_apd_f.h"
#include "esc_apd_hv.h"
#include "esc_castle.h"
#include "esc_hw3.h"
#include "esc_hw4.h"
#include "esc_hw5.h"
#include "esc_kontronik.h"
#include "esc_omp_m4.h"
#include "esc_pwm.h"
#include "esc_ztw.h"
#include "fuel_meter.h"
#include "gps.h"
#include "hardware/i2c.h"
#include "hardware/irq.h"
#include "ibus.h"
#include "ina3221.h"
#include "ms5611.h"
#include "ntc.h"
#include "pico/stdlib.h"
#include "pwm_out.h"
#include "smart_esc.h"
#include "stdlib.h"
#include "string.h"
#include "uart.h"
#include "uart_pio.h"
#include "voltage.h"
#include "xgzp68xxd.h"

#define HOTT_VARIO_MODULE_ID 0x89
#define HOTT_GPS_MODULE_ID 0x8A
#define HOTT_ESC_MODULE_ID 0x8C
#define HOTT_GENERAL_AIR_MODULE_ID 0x8D
#define HOTT_ELECTRIC_AIR_MODULE_ID 0x8E  // not used, for internal Hott telemetry

#define HOTT_VARIO_TEXT_ID ((HOTT_VARIO_MODULE_ID << 4) & 0xFF)
#define HOTT_GPS_TEXT_ID ((HOTT_GPS_MODULE_ID << 4) & 0xFF)
#define HOTT_ESC_TEXT_ID ((HOTT_ESC_MODULE_ID << 4) & 0xFF)
#define HOTT_GENERAL_AIR_TEXT_ID ((HOTT_GENERAL_AIR_MODULE_ID << 4) & 0xFF)
#define HOTT_ELECTRIC_AIR_TEXT_ID ((HOTT_ELECTRIC_AIR_MODULE_ID << 4) & 0xFF)

#define HOTT_BINARY_MODE_REQUEST_ID 0x80

#define ALARM_VOICE_MAX_SENSOR_1_VOLTAGE 0x0A
#define ALARM_VOICE_MAX_SENSOR_2_VOLTAGE 0x0B
#define ALARM_VOICE_UNKNOWN4 0x0C
#define ALARM_VOICE_POSITIVE_DIFFERENCE_2 0x0D
#define ALARM_VOICE_POSITIVE_DIFFERENCE_1 0x0E
#define ALARM_VOICE_MIN_ALTITUDE 0x0F
#define ALARM_VOICE_MIN_POWER_VOLTAGE 0x10
#define ALARM_VOICE_MIN_CELL_VOLTAGE 0x11
#define ALARM_VOICE_MIN_SENSOR_1_VOLTAGE 0x12
#define ALARM_VOICE_MIN_SENSOR_2_VOLTAGE 0x13
#define ALARM_VOICE_MIN_RPM 0x14
#define ALARM_VOICE_UNKNOWN5 0x15
#define ALARM_VOICE_MAX_CAPACITY 0x16
#define ALARM_VOICE_MAX_CURRENT 0x17
#define ALARM_VOICE_MAX_POWER_VOLTAGE 0x18
#define ALARM_VOICE_MAX_RPM 0x19
#define ALARM_VOICE_MAX_ALTITUDE 0x1A

typedef enum alarm_vario_t {
    ALARM_BITMASK_VARIO_ALTITUDE = 0,
    ALARM_BITMASK_VARIO_MAX_ALTITUDE,
    ALARM_BITMASK_VARIO_MIN_ALTITUDE,
    ALARM_BITMASK_VARIO_M1S,
    ALARM_BITMASK_VARIO_M3S,
    ALARM_BITMASK_VARIO_M10S,
} alarm_vario_t;

typedef enum alarm_airesc_t {
    ALARM_BITMASK_AIRESC_VOLTAGE = 0,
    ALARM_BITMASK_AIRESC_MIN_VOLTAGE,
    ALARM_BITMASK_AIRESC_CAPACITY,
    ALARM_BITMASK_AIRESC_TEMPERATURE,
    ALARM_BITMASK_AIRESC_MAX_TEMPERATURE,
    ALARM_BITMASK_AIRESC_CURRENT,
    ALARM_BITMASK_AIRESC_MAX_CURRENT,
    ALARM_BITMASK_AIRESC_RPM,
    ALARM_BITMASK_AIRESC_MAX_RPM,
    ALARM_BITMASK_AIRESC_THROTTLE,
    ALARM_BITMASK_AIRESC_SPEED,
    ALARM_BITMASK_AIRESC_MAX_SPEED,
    ALARM_BITMASK_AIRESC_BEC_VOLTAGE,
    ALARM_BITMASK_AIRESC_MIN_BEC_VOLTAGE,
    ALARM_BITMASK_AIRESC_BEC_CURRENT,
    ALARM_BITMASK_AIRESC_MIN_BEC_CURRENT,
    ALARM_BITMASK_AIRESC_MAX_BEC_CURRENT,
    ALARM_BITMASK_AIRESC_BEC_TEMPERATURE,
    ALARM_BITMASK_AIRESC_MAX_BEC_TEMPERATURE,
    ALARM_BITMASK_AIRESC_EXT_TEMPERATURE,
    ALARM_BITMASK_AIRESC_MAX_EXT_TEMPERATURE,
    ALARM_BITMASK_AIRESC_RPM_WITHOUT_GEAR,
} alarm_airesc_t;

typedef enum alarm_general_air_t {
    ALARM_BITMASK_GENERAL_AIR_CELL_VOLTAGE = 0,
    ALARM_BITMASK_GENERAL_AIR_BATTERY_1,
    ALARM_BITMASK_GENERAL_AIR_BATTERY_2,
    ALARM_BITMASK_GENERAL_AIR_TEMPERATURE_1,
    ALARM_BITMASK_GENERAL_AIR_TEMPERATURE_2,
    ALARM_BITMASK_GENERAL_AIR_FUEL_PERCENT,
    ALARM_BITMASK_GENERAL_AIR_FUEL_ML,
    ALARM_BITMASK_GENERAL_AIR_RPM,
    ALARM_BITMASK_GENERAL_AIR_ALTITUDE,
    ALARM_BITMASK_GENERAL_AIR_CLIMBRATE,
    ALARM_BITMASK_GENERAL_AIR_CLIMBRATE3S,
    ALARM_BITMASK_GENERAL_AIR_CURRENT,
    ALARM_BITMASK_GENERAL_AIR_VOLTAGE,
    ALARM_BITMASK_GENERAL_AIR_CAPACITY,
    ALARM_BITMASK_GENERAL_AIR_SPEED,
    ALARM_BITMASK_GENERAL_AIR_MIN_CELL_VOLTAGE,
    ALARM_BITMASK_GENERAL_AIR_MIN_CELL_VOLTAGE_NUM,
    ALARM_BITMASK_GENERAL_AIR_RPM_2,
} alarm_general_air_t;

typedef enum alarm_gps_t {
    ALARM_BITMASK_GPS_FLIGHT_DIRECTION = 0,
    ALARM_BITMASK_GPS_SPEED,
    ALARM_BITMASK_GPS_LATITUDE,
    ALARM_BITMASK_GPS_LONGITUDE,
    ALARM_BITMASK_GPS_DISTANCE,
    ALARM_BITMASK_GPS_ALTITUDE,
    ALARM_BITMASK_GPS_CLIMBRATE,
    ALARM_BITMASK_GPS_CLIMBRATE3S,
    ALARM_BITMASK_GPS_SATS,
} alarm_general_gps_t;

typedef struct hott_sensor_vario_t {
    uint8_t startByte;  // 1
    uint8_t sensorID;
    uint8_t warningID;
    uint8_t sensorTextID;
    uint8_t alarmInverse;
    uint16_t altitude;     // 6-7 value + 500 (e.g. 0m = 500)
    uint16_t maxAltitude;  // 8-9
    uint16_t minAltitude;
    uint16_t m1s;   // 12-13 (value * 100) + 30000 (e.g. 10m = 31000)
    uint16_t m3s;   // ?? idem
    uint16_t m10s;  // ?? idem
    uint8_t text[24];
    uint8_t version;
    uint8_t empty;
    uint8_t endByte;
    uint8_t checksum;
} __attribute__((packed)) hott_sensor_vario_t;

typedef struct hott_sensor_airesc_t {
    uint8_t startByte;                  // 1
    uint8_t sensorID;                   // 2
    uint8_t warningID;                  // 3
    uint8_t sensorTextID;               // Byte 4
    uint16_t alarmInverse;              // Byte 5, 6
    uint16_t inputVolt;                 // Byte 7,8
    uint16_t minInputVolt;              // Byte 9,10
    uint16_t capacity;                  // Byte 11,12
    uint8_t escTemperature;             // Byte 13
    uint8_t maxEscTemperature;          // Byte 14
    uint16_t current;                   // Byte 15,16
    uint16_t maxCurrent;                // Byte 17,18
    uint16_t RPM;                       // Byte 19,20
    uint16_t maxRPM;                    // Byte 21,22
    uint8_t throttlePercent;            // Byte 23
    uint16_t speed;                     // Byte 24,25
    uint16_t maxSpeed;                  // Byte 26,27
    uint8_t BECVoltage;                 // Byte 28
    uint8_t minBECVoltage;              // Byte 29
    uint8_t BECCurrent;                 // Byte 30
    uint8_t minBECCurrent;              // Byte 31
    uint8_t maxBECCurrent;              // Byte 32
    uint8_t PWM;                        // Byte 33
    uint8_t BECTemperature;             // Byte 34
    uint8_t maxBECTemperature;          // Byte 35
    uint8_t motorOrExtTemperature;      // Byte 36
    uint8_t maxMotorOrExtTemperature;   // Byte 37
    uint16_t RPMWithoutGearOrExt;       // Byte 38,39
    uint8_t timing;                     // Byte 40
    uint8_t advancedTiming;             // Byte 41
    uint8_t highestCurrentMotorNumber;  // Byte 42
    uint8_t version;                    /* Byte 43: 00 version number */
    uint8_t endByte;                    /* Byte 44: 0x7D Ende byte */
    uint8_t checksum;                   /* Byte 45: Parity Byte */
} __attribute__((packed)) hott_sensor_airesc_t;

// used by internal receiver vario (shouldnt be used)
typedef struct hott_sensor_electric_air_t {
    uint8_t startByte;      // 1
    uint8_t sensorID;       // 2
    uint8_t warningID;      // 3: Alarm
    uint8_t sensorTextID;   // 4:
    uint16_t alarmInverse;  // 5 6: alarm bitmask. Value is displayed inverted
    uint8_t cell1L;         // 7: Low Voltage Cell 1 in 0,02 V steps
    uint8_t cell2L;         // 8: Low Voltage Cell 2 in 0,02 V steps
    uint8_t cell3L;         // 9: Low Voltage Cell 3 in 0,02 V steps
    uint8_t cell4L;         // 10: Low Voltage Cell 4 in 0,02 V steps
    uint8_t cell5L;         // 11: Low Voltage Cell 5 in 0,02 V steps
    uint8_t cell6L;         // 12: Low Voltage Cell 6 in 0,02 V steps
    uint8_t cell7L;         // 13: Low Voltage Cell 7 in 0,02 V steps
    uint8_t cell1H;         // 14: High Voltage Cell 1 in 0.02 V steps
    uint8_t cell2H;         // 15
    uint8_t cell3H;         // 16
    uint8_t cell4H;         // 17
    uint8_t cell5H;         // 18
    uint8_t cell6H;         // 19
    uint8_t cell7H;         // 20
    uint16_t battery1;      // 21 Battery 1 in 100mv steps; 50 == 5V
    uint16_t battery2;      // 23 Battery 2 in 100mv steps; 50 == 5V
    uint8_t temp1;          // 25 Temp 1; Offset of 20. 20 == 0C
    uint8_t temp2;          // 26 Temp 2; Offset of 20. 20 == 0C
    uint16_t height;        // 27 28 Height. Offset -500. 500 == 0
    uint16_t current;       // 29 30 1 = 0.1A
    uint16_t driveVoltage;  // 31
    uint16_t capacity;      // 33 34 mAh
    uint16_t m2s;           // 35 36  /* Steigrate m2s; 0x48 == 0
    uint8_t m3s;            // 37  /* Steigrate m3s; 0x78 == 0
    uint16_t rpm;           // 38 39 /* RPM. 10er steps; 300 == 3000rpm
    uint8_t minutes;        // 40
    uint8_t seconds;        // 41
    uint8_t speed;          // 42
    uint8_t version;        // 43
    uint8_t endByte;        // 44
    uint8_t checksum;       // 45
} __attribute__((packed)) hott_sensor_electric_air_t;

typedef struct hott_sensor_general_air_t {
    uint8_t startByte;             //#01 start byte constant value 0x7c
    uint8_t sensorID;              //#02 EAM sensort id. constat value 0x8d=GENRAL AIR MODULE
    uint8_t warningID;             //#03 1=A 2=B ... 0x1a=Z 0 = no alarm
                                   /* VOICE OR BIP WARNINGS
                           Alarme sonore A.. Z, octet correspondant 1 à 26
                           0x00 00 0 No alarm
                           0x01 01 A
                           0x02 02 B Negative Difference 2 B
                           0x03 03 C Negative Difference 1 C
                           0x04 04 D
                           0x05 05 E
                           0x06 06 F Min. Sensor 1 temp. F
                           0x07 07 G Min. Sensor 2 temp. G
                           0x08 08 H Max. Sensor 1 temp. H
