#include "hott.h"

#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "airspeed.h"
#include "bmp180.h"
#include "bmp280.h"
#include "common.h"
#include "config.h"
#include "current.h"
#include "esc_apd_f.h"
#include "esc_apd_hv.h"
#include "esc_castle.h"
#include "esc_hw3.h"
#include "esc_hw4.h"
#include "esc_hw5.h"
#include "esc_kontronik.h"
#include "esc_pwm.h"
#include "hardware/i2c.h"
#include "hardware/irq.h"
#include "ibus.h"
#include "ms5611.h"
#include "nmea.h"
#include "ntc.h"
#include "pico/stdlib.h"
#include "pwm_out.h"
#include "stdlib.h"
#include "string.h"
#include "uart.h"
#include "uart_pio.h"
#include "voltage.h"

#define HOTT_VARIO_MODULE_ID 0x89
#define HOTT_GPS_MODULE_ID 0x8A
#define HOTT_ESC_MODULE_ID 0x8C
#define HOTT_GENERAL_AIR_MODULE_ID 0x8D  // not used
#define HOTT_ELECTRIC_AIR_MODULE_ID 0x8E

#define HOTT_VARIO_SENSOR_ID 0x90
#define HOTT_GPS_SENSOR_ID 0xA0
#define HOTT_ESC_SENSOR_ID 0xC0
#define HOTT_GENERAL_AIR_SENSOR_ID 0xD0
#define HOTT_ELECTRIC_AIR_SENSOR_ID 0xE0

#define HOTT_TEXT_MODE_REQUEST_GPS 0xAF
#define HOTT_TEXT_MODE_REQUEST_GENERAL_AIR 0xDF
#define HOTT_TEXT_MODE_REQUEST_ELECTRIC_AIR 0xEF

#define HOTT_BINARY_MODE_REQUEST_ID 0x80
#define HOTT_TEXT_MODE_REQUEST_ID 0x7F

#define HOTT_TIMEOUT_US 2000
#define HOTT_PACKET_LENGHT 2

#define HOTT_START_BYTE 0x7C
#define HOTT_END_BYTE 0x7D

// TYPE
#define HOTT_TYPE_VARIO 0
#define HOTT_TYPE_ESC 1
#define HOTT_TYPE_ELECTRIC 2
#define HOTT_TYPE_GPS 3

// VARIO
#define HOTT_VARIO_ALTITUDE 0
#define HOTT_VARIO_M1S 1
#define HOTT_VARIO_M3S 2
#define HOTT_VARIO_M10S 3

//  ESC
#define HOTT_ESC_VOLTAGE 0
#define HOTT_ESC_CAPACITY 1
#define HOTT_ESC_TEMPERATURE 2
#define HOTT_ESC_CURRENT 3
#define HOTT_ESC_RPM 4
#define HOTT_ESC_THROTTLE 5  // 0-100%
#define HOTT_ESC_SPEED 6
#define HOTT_ESC_BEC_VOLTAGE 7
#define HOTT_ESC_BEC_CURRENT 8
#define HOTT_ESC_BEC_TEMPERATURE 9
#define HOTT_ESC_EXT_TEMPERATURE 10

// ELECTRIC (BATTERY)
#define HOTT_ELECTRIC_EXT_TEMPERATURE 0
#define HOTT_ELECTRIC_CELL_BAT_1_VOLTAGE 1
#define HOTT_ELECTRIC_CELL_BAT_2_VOLTAGE 2
#define HOTT_ELECTRIC_BAT_1_VOLTAGE 3
#define HOTT_ELECTRIC_BAT_2_VOLTAGE 4
#define HOTT_ELECTRIC_TEMPERATURE_1 5
#define HOTT_ELECTRIC_TEMPERATURE_2 6
#define HOTT_ELECTRIC_HEIGHT 7
#define HOTT_ELECTRIC_CURRENT 8
#define HOTT_ELECTRIC_CAPACITY 9
#define HOTT_ELECTRIC_M2S 10
#define HOTT_ELECTRIC_M3S 11
#define HOTT_ELECTRIC_RPM 12
#define HOTT_ELECTRIC_MINUTES 13
#define HOTT_ELECTRIC_SECONDS 14
#define HOTT_ELECTRIC_SPEED 15

// GPS
#define HOTT_GPS_DIRECTION 0
#define HOTT_GPS_SPEED 1
#define HOTT_GPS_LATITUDE 2
#define HOTT_GPS_LONGITUDE 3
#define HOTT_GPS_DISTANCE 4
#define HOTT_GPS_ALTITUDE 5
#define HOTT_GPS_CLIMBRATE 6
#define HOTT_GPS_CLIMBRATE3S 7
#define HOTT_GPS_SATS 8

// GENERAL (FUEL) - not used by msrc
#define HOTT_GENERAL_CELL 0
#define HOTT_GENERAL_BATTERY_1 1
#define HOTT_GENERAL_BATTERY_2 2
#define HOTT_GENERAL_TEMP_1 3
#define HOTT_GENERAL_TEMP_2 4
#define HOTT_GENERAL_RPM_1 5
#define HOTT_GENERAL_ALTITUDE 6
#define HOTT_GENERAL_CLIMBRATE 7
#define HOTT_GENERAL_CLIMBRATE3S 8
#define HOTT_GENERAL_CURRENT 9
#define HOTT_GENERAL_VOLTAGE 10
#define HOTT_GENERAL_CAPACITY 11
#define HOTT_GENERAL_SPEED 12
#define HOTT_GENERAL_RPM_2 13
#define HOTT_GENERAL_PRESSURE 14

typedef struct hott_sensor_vario_t {
    uint8_t startByte;
    uint8_t sensorID;
    uint8_t warningId;
    uint8_t sensorTextID;
    uint8_t alarmInverse;
    uint16_t altitude;  // value + 500 (e.g. 0m = 500)
    uint16_t maxAltitude;
    uint16_t minAltitude;
    uint16_t m1s;   // ?? (value * 100) + 30000 (e.g. 10m = 31000)
    uint16_t m3s;   // ?? idem
    uint16_t m10s;  // ?? idem
    uint8_t text[24];
    uint8_t empty;
    uint8_t version;
    uint8_t endByte;
    uint8_t checksum;
} __attribute__((packed)) hott_sensor_vario_t;

typedef struct hott_sensor_airesc_t {
    uint8_t startByte;                  // 1
    uint8_t sensorID;                   // 2
    uint8_t warningId;                  // 3
    uint8_t sensorTextID;               // Byte 4
    uint8_t inverse;                    // Byte 5
    uint8_t inverseStatusI;             // Byte 6
    uint16_t inputVolt;                 // Byte 7,8
    uint16_t minInputVolt;              // Byte 9,10
    uint16_t capacity;                  // Byte 11,12
    uint8_t escTemperature;             // Byte 13
    uint8_t maxEscTemperature;          // Byte 14
    uint16_t current;                   // Byte 15,16
    uint16_t maxCurrent;                // Byte 17,18
    uint16_t RPM;                       // Byte 19,20
    uint16_t maxRPM;                    // Byte 21,22
    uint8_t throttlePercent;            // Byte 23
    uint16_t speed;                     // Byte 24,25
    uint16_t maxSpeed;                  // Byte 26,27
    uint8_t BECVoltage;                 // Byte 28
    uint8_t minBECVoltage;              // Byte 29
    uint8_t BECCurrent;                 // Byte 30
    uint8_t minBECCurrent;              // Byte 31
    uint8_t maxBECCurrent;              // Byte 32
    uint8_t PWM;                        // Byte 33
    uint8_t BECTemperature;             // Byte 34
    uint8_t maxBECTemperature;          // Byte 35
    uint8_t motorOrExtTemperature;      // Byte 36
    uint8_t maxMotorOrExtTemperature;   // Byte 37
    uint16_t RPMWithoutGearOrExt;       // Byte 38,39
    uint8_t timing;                     // Byte 40
    uint8_t advancedTiming;             // Byte 41
    uint8_t highestCurrentMotorNumber;  // Byte 42
    uint8_t version;                    /* Byte 43: 00 version number */
    uint8_t endByte;                    /* Byte 44: 0x7D Ende byte */
    uint8_t checksum;                   /* Byte 45: Parity Byte */
} __attribute__((packed)) hott_sensor_airesc_t;

typedef struct hott_sensor_electric_air_t {
    uint8_t startByte;      // 1
    uint8_t sensorID;       // 2
    uint8_t alarmTone;      // 3: Alarm
    uint8_t sensorTextID;   // 4:
    uint8_t alarmInverse1;  // 5:
    uint8_t alarmInverse2;  // 6:
    uint8_t cell1L;         // 7: Low Voltage Cell 1 in 0,02 V steps
    uint8_t cell2L;         // 8: Low Voltage Cell 2 in 0,02 V steps
    uint8_t cell3L;         // 9: Low Voltage Cell 3 in 0,02 V steps
    uint8_t cell4L;         // 10: Low Voltage Cell 4 in 0,02 V steps
    uint8_t cell5L;         // 11: Low Voltage Cell 5 in 0,02 V steps
    uint8_t cell6L;         // 12: Low Voltage Cell 6 in 0,02 V steps
    uint8_t cell7L;         // 13: Low Voltage Cell 7 in 0,02 V steps
    uint8_t cell1H;         // 14: High Voltage Cell 1 in 0.02 V steps
    uint8_t cell2H;         // 15
    uint8_t cell3H;         // 16
    uint8_t cell4H;         // 17
    uint8_t cell5H;         // 18
    uint8_t cell6H;         // 19
    uint8_t cell7H;         // 20
    uint16_t battery1;      // 21 Battery 1 in 100mv steps; 50 == 5V
    uint16_t battery2;      // 23 Battery 2 in 100mv steps; 50 == 5V
    uint8_t temp1;          // 25 Temp 1; Offset of 20. 20 == 0C
    uint8_t temp2;          // 26 Temp 2; Offset of 20. 20 == 0C
    uint16_t height;        // 27 28 Height. Offset -500. 500 == 0
    uint16_t current;       // 29 30 1 = 0.1A
    uint16_t driveVoltage;  // 31
    uint16_t capacity;      // 33 34 mAh
    uint16_t m2s;           // 35 36  /* Steigrate m2s; 0x48 == 0
    uint8_t m3s;            // 37  /* Steigrate m3s; 0x78 == 0
    uint16_t rpm;           // 38 39 /* RPM. 10er steps; 300 == 3000rpm
    uint8_t minutes;        // 40
    uint8_t seconds;        // 41
    uint8_t speed;          // 42
    uint8_t version;        // 43
    uint8_t endByte;        // 44
    uint8_t checksum;       // 45
} __attribute__((packed)) hott_sensor_electric_air_t;

typedef struct hott_sensor_general_air_t {
    uint8_t startByte;             //#01 start byte constant value 0x7c
    uint8_t sensorID;              //#02 EAM sensort id. constat value 0x8d=GENRAL AIR MODULE
    uint8_t alarmTone;             //#03 1=A 2=B ... 0x1a=Z 0 = no alarm
                                   /* VOICE OR BIP WARNINGS
                           Alarme sonore A.. Z, octet correspondant 1 à 26
                           0x00 00 0 No alarm
                           0x01 01 A
                           0x02 02 B Negative Difference 2 B
                           0x03 03 C Negative Difference 1 C
                           0x04 04 D
                           0x05 05 E
                           0x06 06 F Min. Sensor 1 temp. F
                           0x07 07 G Min. Sensor 2 temp. G
                           0x08 08 H Max. Sensor 1 temp. H
